In [3]:
import sqlite3
import pandas as pd

In [4]:
dir_db = 'chinook.db'
conn = sqlite3.connect(dir_db)

In [6]:
# Creamos el cursor
cursor =  conn.cursor()

In [10]:
query = '''
SELECT *
FROM albums
'''

In [11]:
mi_query = cursor.execute(query)

In [14]:
mi_query.fetchall()

[]

In [15]:
pd.read_sql_query(query, conn)

     AlbumId                                              Title  ArtistId
0          1              For Those About To Rock We Salute You         1
1          2                                  Balls to the Wall         2
2          3                                  Restless and Wild         2
3          4                                  Let There Be Rock         1
4          5                                           Big Ones         3
..       ...                                                ...       ...
342      343                             Respighi:Pines of Rome       226
343      344  Schubert: The Late String Quartets & String Qu...       272
344      345                                Monteverdi: L'Orfeo       273
345      346                              Mozart: Chamber Music       274
346      347  Koyaanisqatsi (Soundtrack from the Motion Pict...       275

[347 rows x 3 columns]

In [19]:
query = '''
SELECT *
FROM customers, invoices
WHERE customers.CustomerId
'''
query = '''
SELECT *
FROM customers
JOIN invoices ON customers.CustomerId = invoices.CustomerId
'''


pd.read_sql_query(query, conn).head()

,CustomerId,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,...,SupportRepId,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,98,1,2010-03-11 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.98
1,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,121,1,2010-06-13 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.96
2,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,143,1,2010-09-15 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,5.94
3,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,195,1,2011-05-06 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,0.99
4,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,316,1,2012-10-27 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,1.98

In [20]:
query = '''
SELECT c.LastName
FROM customers c
JOIN invoices i ON c.CustomerId = i.CustomerId
'''


pd.read_sql_query(query, conn).head()

    LastName
0  Gonçalves
1  Gonçalves
2  Gonçalves
3  Gonçalves
4  Gonçalves

In [21]:
query = '''
SELECT c.Firstname , i.InvoiceID, i.InvoiceDate, i.BillingCountry
FROM customers c
JOIN invoices i ON c.CustomerId = i.CustomerId
WHERE c.Country = 'Brazil'
'''


pd.read_sql_query(query, conn).head()

  FirstName  InvoiceId          InvoiceDate BillingCountry
0      Luís         98  2010-03-11 00:00:00         Brazil
1      Luís        121  2010-06-13 00:00:00         Brazil
2      Luís        143  2010-09-15 00:00:00         Brazil
3      Luís        195  2011-05-06 00:00:00         Brazil
4      Luís        316  2012-10-27 00:00:00         Brazil

In [26]:
query = '''
SELECT e.FirstName || ',' || e.LastName as 'Nombre Empleado', i.*
FROM employees e
JOIN customers c ON e.EmployeeId = c.SupportRepId
JOIN invoices i ON c.CustomerId = i.CustomerId
'''


pd.read_sql_query(query, conn).head()

,Nombre Empleado,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,"Jane,Peacock",98,1,2010-03-11 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.98
1,"Jane,Peacock",121,1,2010-06-13 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.96
2,"Jane,Peacock",143,1,2010-09-15 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,5.94
3,"Jane,Peacock",195,1,2011-05-06 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,0.99
4,"Jane,Peacock",316,1,2012-10-27 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,1.98

In [28]:
query = '''
SELECT c.FirstName, c.LastName, c.Country, e.FirstName, i.Total
FROM customers c
JOIN  employees e ON c.SupportRepId = e.EmployeeId
JOIN invoices i ON c.CustomerId = i.CustomerId
'''


pd.read_sql_query(query, conn).head()

  FirstName   LastName Country FirstName  Total
0      Luís  Gonçalves  Brazil      Jane   3.98
1      Luís  Gonçalves  Brazil      Jane   3.96
2      Luís  Gonçalves  Brazil      Jane   5.94
3      Luís  Gonçalves  Brazil      Jane   0.99
4      Luís  Gonçalves  Brazil      Jane   1.98

In [35]:
query = '''
SELECT t.Name, i.*
FROM invoices i
JOIN  invoice_items i_i ON i.InvoiceId = i_i.InvoiceLineId
JOIN tracks t ON i_i.InvoiceLineId = t.TrackId
'''


pd.read_sql_query(query, conn).head()

,Name,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,For Those About To Rock (We Salute You),1,2,2009-01-01 00:00:00,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,1.98
1,Balls to the Wall,2,4,2009-01-02 00:00:00,Ullevålsveien 14,Oslo,None,Norway,0171,3.96
2,Fast As a Shark,3,8,2009-01-03 00:00:00,Grétrystraat 63,Brussels,None,Belgium,1000,5.94
3,Restless and Wild,4,14,2009-01-06 00:00:00,8210 111 ST NW,Edmonton,AB,Canada,T6G 2C7,8.91
4,Princess of the Dawn,5,23,2009-01-11 00:00:00,69 Salem Street,Boston,MA,USA,2113,13.86

In [39]:
query = '''
SELECT t.Name, m.Name, a.Title, g.Name
FROM tracks t
JOIN  albums a ON t.AlbumId = a.AlbumId
JOIN media_types m ON t.MediaTypeId = m.MediaTypeId
JOIN genres g ON t.GenreId = g.GenreId
'''


pd.read_sql_query(query, conn).head()

,Name,Name,Title,Name
0,For Those About To Rock (We Salute You),MPEG audio file,For Those About To Rock We Salute You,Rock
1,Balls to the Wall,Protected AAC audio file,Balls to the Wall,Rock
2,Fast As a Shark,Protected AAC audio file,Restless and Wild,Rock
3,Restless and Wild,Protected AAC audio file,Restless and Wild,Rock
4,Princess of the Dawn,Protected AAC audio file,Restless and Wild,Rock